tools/k6/resultats/avant-2026-09-24/palier-10.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/macbookpro/klassio-saas/tools/k6/charge.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m27s max duration (incl. graceful stop):
              * matinee: Up to 10 looping VUs for 1m7s over 3 stages (gracefulRampDown: 20s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
matinee   [   0% ] 01/10 VUs  0m00.3s/1m07.0s

running (0m02.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
matinee   [   2% ] 02/10 VUs  0m01.3s/1m07.0s

running (0m03.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
matinee   [   3% ] 02/10 VUs  0m02.3s/1m07.0s

running (0m04.0s), 03/10 VUs, 0 complete and 0 interrupted iterations
matinee   [   5% ] 03/10 VUs  0m03.3s/1m07.0s

running (0m05.0s), 04/10 VUs, 0 complete and 0 interrupted iterations
matinee   [   6% ] 04/10 VUs  0m04.3s/1m07.0s

running (0m06.0s), 05/10 VUs, 1 complete and 0 interrupted iterations
matinee   [   8% ] 05/10 VUs  0m05.3s/1m07.0s

running (0m07.0s), 06/10 VUs, 3 complete and 0 interrupted iterations
matinee   [   9% ] 06/10 VUs  0m06.3s/1m07.0s

running (0m08.0s), 06/10 VUs, 3 complete and 0 interrupted iterations
matinee   [  11% ] 06/10 VUs  0m07.3s/1m07.0s

running (0m09.0s), 07/10 VUs, 3 complete and 0 interrupted iterations
matinee   [  12% ] 07/10 VUs  0m08.3s/1m07.0s

running (0m10.0s), 08/10 VUs, 5 complete and 0 interrupted iterations
matinee   [  14% ] 08/10 VUs  0m09.3s/1m07.0s

running (0m11.0s), 09/10 VUs, 5 complete and 0 interrupted iterations
matinee   [  15% ] 09/10 VUs  0m10.3s/1m07.0s

running (0m12.0s), 10/10 VUs, 6 complete and 0 interrupted iterations
matinee   [  17% ] 10/10 VUs  0m11.3s/1m07.0s

running (0m13.0s), 10/10 VUs, 6 complete and 0 interrupted iterations
matinee   [  18% ] 10/10 VUs  0m12.3s/1m07.0s

running (0m14.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
matinee   [  20% ] 10/10 VUs  0m13.3s/1m07.0s

running (0m15.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
matinee   [  21% ] 10/10 VUs  0m14.3s/1m07.0s

running (0m16.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
matinee   [  23% ] 10/10 VUs  0m15.3s/1m07.0s

running (0m17.0s), 10/10 VUs, 14 complete and 0 interrupted iterations
matinee   [  24% ] 10/10 VUs  0m16.3s/1m07.0s

running (0m18.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
matinee   [  26% ] 10/10 VUs  0m17.3s/1m07.0s

running (0m19.0s), 10/10 VUs, 19 complete and 0 interrupted iterations
matinee   [  27% ] 10/10 VUs  0m18.3s/1m07.0s

running (0m20.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
matinee   [  29% ] 10/10 VUs  0m19.3s/1m07.0s

running (0m21.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
matinee   [  30% ] 10/10 VUs  0m20.3s/1m07.0s

running (0m22.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
matinee   [  32% ] 10/10 VUs  0m21.3s/1m07.0s

running (0m23.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
matinee   [  33% ] 10/10 VUs  0m22.3s/1m07.0s

running (0m24.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
matinee   [  35% ] 10/10 VUs  0m23.3s/1m07.0s

running (0m25.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
matinee   [  36% ] 10/10 VUs  0m24.3s/1m07.0s

running (0m26.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
matinee   [  38% ] 10/10 VUs  0m25.3s/1m07.0s

running (0m27.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
matinee   [  39% ] 10/10 VUs  0m26.3s/1m07.0s

running (0m28.0s), 10/10 VUs, 34 complete and 0 interrupted iterations
matinee   [  41% ] 10/10 VUs  0m27.3s/1m07.0s

running (0m29.0s), 10/10 VUs, 34 complete and 0 interrupted iterations
matinee   [  42% ] 10/10 VUs  0m28.3s/1m07.0s

running (0m30.0s), 10/10 VUs, 36 complete and 0 interrupted iterations
matinee   [  44% ] 10/10 VUs  0m29.3s/1m07.0s

running (0m31.0s), 10/10 VUs, 38 complete and 0 interrupted iterations
matinee   [  45% ] 10/10 VUs  0m30.3s/1m07.0s

running (0m32.0s), 10/10 VUs, 38 complete and 0 interrupted iterations
matinee   [  47% ] 10/10 VUs  0m31.3s/1m07.0s

running (0m33.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
matinee   [  48% ] 10/10 VUs  0m32.3s/1m07.0s

running (0m34.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
matinee   [  50% ] 10/10 VUs  0m33.3s/1m07.0s

running (0m35.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
matinee   [  51% ] 10/10 VUs  0m34.3s/1m07.0s

running (0m36.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
matinee   [  53% ] 10/10 VUs  0m35.3s/1m07.0s

running (0m37.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
matinee   [  54% ] 10/10 VUs  0m36.3s/1m07.0s

running (0m38.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
matinee   [  56% ] 10/10 VUs  0m37.3s/1m07.0s

running (0m39.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
matinee   [  57% ] 10/10 VUs  0m38.3s/1m07.0s

running (0m40.0s), 10/10 VUs, 53 complete and 0 interrupted iterations
matinee   [  59% ] 10/10 VUs  0m39.3s/1m07.0s

running (0m41.0s), 10/10 VUs, 54 complete and 0 interrupted iterations
matinee   [  60% ] 10/10 VUs  0m40.3s/1m07.0s

running (0m42.0s), 10/10 VUs, 56 complete and 0 interrupted iterations
matinee   [  62% ] 10/10 VUs  0m41.3s/1m07.0s

running (0m43.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
matinee   [  63% ] 10/10 VUs  0m42.3s/1m07.0s

running (0m44.0s), 10/10 VUs, 59 complete and 0 interrupted iterations
matinee   [  65% ] 10/10 VUs  0m43.3s/1m07.0s

running (0m45.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
matinee   [  66% ] 10/10 VUs  0m44.3s/1m07.0s

running (0m46.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
matinee   [  68% ] 10/10 VUs  0m45.3s/1m07.0s

running (0m47.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
matinee   [  69% ] 10/10 VUs  0m46.3s/1m07.0s

running (0m48.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
matinee   [  71% ] 10/10 VUs  0m47.3s/1m07.0s

running (0m49.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
matinee   [  72% ] 10/10 VUs  0m48.3s/1m07.0s

running (0m50.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
matinee   [  74% ] 10/10 VUs  0m49.3s/1m07.0s

running (0m51.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
matinee   [  75% ] 10/10 VUs  0m50.3s/1m07.0s

running (0m52.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
matinee   [  77% ] 10/10 VUs  0m51.3s/1m07.0s

running (0m53.0s), 10/10 VUs, 74 complete and 0 interrupted iterations
matinee   [  78% ] 10/10 VUs  0m52.3s/1m07.0s

running (0m54.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
matinee   [  80% ] 10/10 VUs  0m53.3s/1m07.0s

running (0m55.0s), 10/10 VUs, 78 complete and 0 interrupted iterations
matinee   [  81% ] 10/10 VUs  0m54.3s/1m07.0s

running (0m56.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
matinee   [  83% ] 10/10 VUs  0m55.3s/1m07.0s

running (0m57.0s), 10/10 VUs, 81 complete and 0 interrupted iterations
matinee   [  84% ] 10/10 VUs  0m56.3s/1m07.0s

running (0m58.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
matinee   [  86% ] 10/10 VUs  0m57.3s/1m07.0s

running (0m59.0s), 10/10 VUs, 84 complete and 0 interrupted iterations
matinee   [  87% ] 10/10 VUs  0m58.3s/1m07.0s

running (1m00.0s), 09/10 VUs, 85 complete and 0 interrupted iterations
matinee   [  89% ] 09/10 VUs  0m59.3s/1m07.0s

running (1m01.0s), 08/10 VUs, 89 complete and 0 interrupted iterations
matinee   [  90% ] 08/10 VUs  1m00.3s/1m07.0s

running (1m02.0s), 08/10 VUs, 90 complete and 0 interrupted iterations
matinee   [  92% ] 08/10 VUs  1m01.3s/1m07.0s

running (1m03.0s), 08/10 VUs, 91 complete and 0 interrupted iterations
matinee   [  93% ] 08/10 VUs  1m02.3s/1m07.0s

running (1m04.0s), 07/10 VUs, 93 complete and 0 interrupted iterations
matinee   [  95% ] 07/10 VUs  1m03.3s/1m07.0s

running (1m05.0s), 06/10 VUs, 94 complete and 0 interrupted iterations
matinee   [  96% ] 06/10 VUs  1m04.3s/1m07.0s

running (1m06.0s), 06/10 VUs, 95 complete and 0 interrupted iterations
matinee   [  97% ] 06/10 VUs  1m05.3s/1m07.0s

running (1m07.0s), 05/10 VUs, 96 complete and 0 interrupted iterations
matinee   [  99% ] 05/10 VUs  1m06.3s/1m07.0s

running (1m08.0s), 04/10 VUs, 97 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 04/10 VUs  1m7s

running (1m09.0s), 01/10 VUs, 100 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 04/10 VUs  1m7s

running (1m10.0s), 01/10 VUs, 100 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 04/10 VUs  1m7s

running (1m11.0s), 01/10 VUs, 100 complete and 0 interrupted iterations
matinee ↓ [ 100% ] 04/10 VUs  1m7s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{name:login}
    ✓ 'p(95)<3000' p(95)=229.44ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    klassio_dossier_eleve
    ✓ 'p(95)<500' p(95)=20.13ms

    klassio_liste_eleves
    ✓ 'p(95)<1500' p(95)=100.51ms

    klassio_rapports
    ✓ 'p(95)<1200' p(95)=130.98ms

    klassio_tableau_de_bord
    ✓ 'p(95)<800' p(95)=92.55ms


  █ TOTAL RESULTS 

    checks_total.......: 1515    21.188398/s
    checks_succeeded...: 100.00% 1515 out of 1515
    checks_failed......: 0.00%   0 out of 1515

    ✓ tableau de bord : 200
    ✓ tableau de bord : champs attendus
    ✓ élèves : 200
    ✓ élèves : liste non vide
    ✓ élèves : champ « code » présent
    ✓ dossier : 200
    ✓ dossier : champs attendus
    ✓ rapports : 200
    ✓ rapports : champs attendus
    ✓ classes : 200
    ✓ classes : liste non vide
    ✓ classes : champ « name » présent
    ✓ enfants : 200
    ✓ enfants : liste non vide
    ✓ enfants : champ « code » présent

    CUSTOM
    klassio_dossier_eleve..........: med=12.65ms  p(90)=16.96ms  p(95)=20.13ms  p(99)=44.97ms  max=147.69ms
    klassio_liste_eleves...........: med=71.9ms   p(90)=84.02ms  p(95)=100.51ms p(99)=139.55ms max=146.58ms
    klassio_rapports...............: med=73.15ms  p(90)=94.97ms  p(95)=130.98ms p(99)=170.65ms max=175.3ms 
    klassio_tableau_de_bord........: med=55.21ms  p(90)=73.02ms  p(95)=92.55ms  p(99)=144.22ms max=255.59ms

    HTTP
    http_req_duration..............: med=24.49ms  p(90)=75.95ms  p(95)=84.22ms  p(99)=150.81ms max=255.59ms
      { expected_response:true }...: med=24.49ms  p(90)=75.95ms  p(95)=84.22ms  p(99)=150.81ms max=255.59ms
      { name:login }...............: med=224.14ms p(90)=228.85ms p(95)=229.44ms p(99)=229.92ms max=230.03ms
    http_req_failed................: 0.00%  0 out of 811
    http_reqs......................: 811    11.342436/s

    EXECUTION
    iteration_duration.............: med=5.95s    p(90)=7.07s    p(95)=7.5s     p(99)=7.84s    max=8.06s   
    iterations.....................: 101    1.41256/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 81 MB  1.1 MB/s
    data_sent......................: 131 kB 1.8 kB/s



running (1m11.5s), 00/10 VUs, 101 complete and 0 interrupted iterations
matinee ✓ [ 100% ] 00/10 VUs  1m7s